{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 39, 39], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "atrousconvolution2d_2"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [1, 1], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "atrousconvolution2d_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\n\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000s\u009c\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000\u0083\u0000\u0000}\u0002\u0000|\u0000\u0000j\u0002\u0000\\\u0004\u0000}\u0003\u0000}\u0004\u0000}\u0005\u0000}\u0006\u0000|\u0002\u0000|\u0000\u0000d\u0003\u0000d\u0004\u0000\u0083\u0003\u0000}\u0007\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000d\u0005\u0000|\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0003\u0000\u0083\u0001\u0001}\b\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000|\u0005\u0000d\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0004\u0000\u0083\u0001\u0001}\t\u0000|\b\u0000|\t\u0000\u0017S(\u0007\u0000\u0000\u0000Ni\u00ff\u00ff\u00ff\u00ff(\u0001\u0000\u0000\u0000t\u0011\u0000\u0000\u0000DiagonalSubtensori\u0002\u0000\u0000\u0000i\u0003\u0000\u0000\u0000i\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axis(\u0005\u0000\u0000\u0000t\u001b\u0000\u0000\u0000theano.tensor.nnet.conv3d2dR\u0000\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0007\u0000\u0000\u0000reshapet\u0006\u0000\u0000\u0000repeat(\n\u0000\u0000\u0000t\u0003\u0000\u0000\u0000varR\u0000\u0000\u0000\u0000t\b\u0000\u0000\u0000takeDiagt\u0002\u0000\u0000\u0000s1t\u0002\u0000\u0000\u0000s2t\u0002\u0000\u0000\u0000s3t\u0002\u0000\u0000\u0000s4t\u0004\u0000\u0000\u0000diagt\u0001\u0000\u0000\u0000at\u0001\u0000\u0000\u0000b(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u0007\u0000\u0000\u0000GetDiag \u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\u0010\u0001\t\u0001\u0015\u0001\u0012\u0001*\u0001*\u0001", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000C\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shape(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u000e\u0000\u0000\u0000out_diag_shape(\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["atrousconvolution2d_2", 0, 0]]], "name": "lambda_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["atrousconvolution2d_1", 0, 0], ["lambda_1", 0, 0]]], "name": "merge_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "atrousconvolution2d_4"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "atrousconvolution2d_3"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\n\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000s\u009c\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000\u0083\u0000\u0000}\u0002\u0000|\u0000\u0000j\u0002\u0000\\\u0004\u0000}\u0003\u0000}\u0004\u0000}\u0005\u0000}\u0006\u0000|\u0002\u0000|\u0000\u0000d\u0003\u0000d\u0004\u0000\u0083\u0003\u0000}\u0007\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000d\u0005\u0000|\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0003\u0000\u0083\u0001\u0001}\b\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000|\u0005\u0000d\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0004\u0000\u0083\u0001\u0001}\t\u0000|\b\u0000|\t\u0000\u0017S(\u0007\u0000\u0000\u0000Ni\u00ff\u00ff\u00ff\u00ff(\u0001\u0000\u0000\u0000t\u0011\u0000\u0000\u0000DiagonalSubtensori\u0002\u0000\u0000\u0000i\u0003\u0000\u0000\u0000i\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axis(\u0005\u0000\u0000\u0000t\u001b\u0000\u0000\u0000theano.tensor.nnet.conv3d2dR\u0000\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0007\u0000\u0000\u0000reshapet\u0006\u0000\u0000\u0000repeat(\n\u0000\u0000\u0000t\u0003\u0000\u0000\u0000varR\u0000\u0000\u0000\u0000t\b\u0000\u0000\u0000takeDiagt\u0002\u0000\u0000\u0000s1t\u0002\u0000\u0000\u0000s2t\u0002\u0000\u0000\u0000s3t\u0002\u0000\u0000\u0000s4t\u0004\u0000\u0000\u0000diagt\u0001\u0000\u0000\u0000at\u0001\u0000\u0000\u0000b(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u0007\u0000\u0000\u0000GetDiag \u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\u0010\u0001\t\u0001\u0015\u0001\u0012\u0001*\u0001*\u0001", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000C\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shape(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u000e\u0000\u0000\u0000out_diag_shape(\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["atrousconvolution2d_4", 0, 0]]], "name": "lambda_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["atrousconvolution2d_3", 0, 0], ["lambda_2", 0, 0]]], "name": "merge_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_2"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "atrousconvolution2d_6"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "atrousconvolution2d_5"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\n\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000s\u009c\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000\u0083\u0000\u0000}\u0002\u0000|\u0000\u0000j\u0002\u0000\\\u0004\u0000}\u0003\u0000}\u0004\u0000}\u0005\u0000}\u0006\u0000|\u0002\u0000|\u0000\u0000d\u0003\u0000d\u0004\u0000\u0083\u0003\u0000}\u0007\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000d\u0005\u0000|\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0003\u0000\u0083\u0001\u0001}\b\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000|\u0005\u0000d\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0004\u0000\u0083\u0001\u0001}\t\u0000|\b\u0000|\t\u0000\u0017S(\u0007\u0000\u0000\u0000Ni\u00ff\u00ff\u00ff\u00ff(\u0001\u0000\u0000\u0000t\u0011\u0000\u0000\u0000DiagonalSubtensori\u0002\u0000\u0000\u0000i\u0003\u0000\u0000\u0000i\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axis(\u0005\u0000\u0000\u0000t\u001b\u0000\u0000\u0000theano.tensor.nnet.conv3d2dR\u0000\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0007\u0000\u0000\u0000reshapet\u0006\u0000\u0000\u0000repeat(\n\u0000\u0000\u0000t\u0003\u0000\u0000\u0000varR\u0000\u0000\u0000\u0000t\b\u0000\u0000\u0000takeDiagt\u0002\u0000\u0000\u0000s1t\u0002\u0000\u0000\u0000s2t\u0002\u0000\u0000\u0000s3t\u0002\u0000\u0000\u0000s4t\u0004\u0000\u0000\u0000diagt\u0001\u0000\u0000\u0000at\u0001\u0000\u0000\u0000b(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u0007\u0000\u0000\u0000GetDiag \u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\u0010\u0001\t\u0001\u0015\u0001\u0012\u0001*\u0001*\u0001", null, null], "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000C\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shape(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u000e\u0000\u0000\u0000out_diag_shape(\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["atrousconvolution2d_6", 0, 0]]], "name": "lambda_3"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["atrousconvolution2d_5", 0, 0], ["lambda_3", 0, 0]]], "name": "merge_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_3"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "atrousconvolution2d_8"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "atrousconvolution2d_7"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\n\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000s\u009c\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000\u0083\u0000\u0000}\u0002\u0000|\u0000\u0000j\u0002\u0000\\\u0004\u0000}\u0003\u0000}\u0004\u0000}\u0005\u0000}\u0006\u0000|\u0002\u0000|\u0000\u0000d\u0003\u0000d\u0004\u0000\u0083\u0003\u0000}\u0007\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000d\u0005\u0000|\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0003\u0000\u0083\u0001\u0001}\b\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000|\u0005\u0000d\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0004\u0000\u0083\u0001\u0001}\t\u0000|\b\u0000|\t\u0000\u0017S(\u0007\u0000\u0000\u0000Ni\u00ff\u00ff\u00ff\u00ff(\u0001\u0000\u0000\u0000t\u0011\u0000\u0000\u0000DiagonalSubtensori\u0002\u0000\u0000\u0000i\u0003\u0000\u0000\u0000i\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axis(\u0005\u0000\u0000\u0000t\u001b\u0000\u0000\u0000theano.tensor.nnet.conv3d2dR\u0000\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0007\u0000\u0000\u0000reshapet\u0006\u0000\u0000\u0000repeat(\n\u0000\u0000\u0000t\u0003\u0000\u0000\u0000varR\u0000\u0000\u0000\u0000t\b\u0000\u0000\u0000takeDiagt\u0002\u0000\u0000\u0000s1t\u0002\u0000\u0000\u0000s2t\u0002\u0000\u0000\u0000s3t\u0002\u0000\u0000\u0000s4t\u0004\u0000\u0000\u0000diagt\u0001\u0000\u0000\u0000at\u0001\u0000\u0000\u0000b(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u0007\u0000\u0000\u0000GetDiag \u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\u0010\u0001\t\u0001\u0015\u0001\u0012\u0001*\u0001*\u0001", null, null], "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000C\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shape(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u000e\u0000\u0000\u0000out_diag_shape(\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["atrousconvolution2d_8", 0, 0]]], "name": "lambda_4"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["atrousconvolution2d_7", 0, 0], ["lambda_4", 0, 0]]], "name": "merge_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "activation_4"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "atrousconvolution2d_10"}, {"class_name": "AtrousConvolution2D", "config": {"atrous_rate": [5, 5], "W_constraint": null, "b_constraint": null, "name": "atrousconvolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 50, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "atrousconvolution2d_9"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\n\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000s\u009c\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000\u0083\u0000\u0000}\u0002\u0000|\u0000\u0000j\u0002\u0000\\\u0004\u0000}\u0003\u0000}\u0004\u0000}\u0005\u0000}\u0006\u0000|\u0002\u0000|\u0000\u0000d\u0003\u0000d\u0004\u0000\u0083\u0003\u0000}\u0007\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000d\u0005\u0000|\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0003\u0000\u0083\u0001\u0001}\b\u0000|\u0007\u0000j\u0003\u0000|\u0003\u0000|\u0004\u0000|\u0005\u0000d\u0005\u0000f\u0004\u0000\u0083\u0001\u0000j\u0004\u0000|\u0005\u0000d\u0006\u0000d\u0004\u0000\u0083\u0001\u0001}\t\u0000|\b\u0000|\t\u0000\u0017S(\u0007\u0000\u0000\u0000Ni\u00ff\u00ff\u00ff\u00ff(\u0001\u0000\u0000\u0000t\u0011\u0000\u0000\u0000DiagonalSubtensori\u0002\u0000\u0000\u0000i\u0003\u0000\u0000\u0000i\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axis(\u0005\u0000\u0000\u0000t\u001b\u0000\u0000\u0000theano.tensor.nnet.conv3d2dR\u0000\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0007\u0000\u0000\u0000reshapet\u0006\u0000\u0000\u0000repeat(\n\u0000\u0000\u0000t\u0003\u0000\u0000\u0000varR\u0000\u0000\u0000\u0000t\b\u0000\u0000\u0000takeDiagt\u0002\u0000\u0000\u0000s1t\u0002\u0000\u0000\u0000s2t\u0002\u0000\u0000\u0000s3t\u0002\u0000\u0000\u0000s4t\u0004\u0000\u0000\u0000diagt\u0001\u0000\u0000\u0000at\u0001\u0000\u0000\u0000b(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u0007\u0000\u0000\u0000GetDiag \u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\u0010\u0001\t\u0001\u0015\u0001\u0012\u0001*\u0001*\u0001", null, null], "name": "lambda_5", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000C\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shape(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000FINAL_Dilated_ICLR_39.pyt\u000e\u0000\u0000\u0000out_diag_shape(\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["atrousconvolution2d_10", 0, 0]]], "name": "lambda_5"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["atrousconvolution2d_9", 0, 0], ["lambda_5", 0, 0]]], "name": "merge_5"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 1}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "flatten_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["flatten_1", 0, 0]], "name": "model_1"}}